app/controllers/pages_controller.rb

  def home
    if current_user
      redirect_to books_path
    end
    @books = Book.last(4)
---
SELECT  "books".* FROM "books"  ORDER BY "books"."id" DESC LIMIT 4

  def dashboard
    @books = current_user.books
    @purchased = Sale.where(buyer_email: current_user.email)
    @sales = Sale.where(seller_email: current_user.email)
---
SELECT "sales".* FROM "sales" WHERE "sales"."buyer_email" = ?  [["buyer_email", "parasarora85@gmail.com"]]
SELECT "sales".* FROM "sales" WHERE "sales"."seller_email" = ?  [["seller_email", "parasarora85@gmail.com"]]